
GetPassphraseDescription = "Vous nécessitez un mot de passe pour déverrouiller la clé privée de l'utilisateur: \"%@\", ID %@";
GetPassphraseDescription_Subkey = "Vous nécessitez une phrase de passe pour déverrouiller la clé privée de l'utilisateur : \"%@\", ID %@, (ID de clé principale %@)";
PassphraseLabel = "Mot de passe :";




/* For Key-Status */
"Invalid" = "Invalide";
"Revoked" = "Révoquée";
"Expired" = "Expirée";
"Disabled" = "Désactivée";
"Unknown" = "Inconnue";
"Never" = "Never";
"Marginal" = "Marginale";
"Full" = "Complète";
"Ultimate" = "Ultime";


/* For Undo and Redo */
Undo_NewKey = "Nouvelle clé";
Undo_Delete = "Supprimer";
Undo_CleanKey = "Nettoyer";
Undo_MinimizeKey = "Réduire";
Undo_RevokeKey = "Révoquer clé";
Undo_ChangeExpirationDate = "Changer la date d'expiration";
Undo_ChangePassphrase = "Changer le mot de passe";
Undo_AlgorithmPreferences = "Changer les préférences d'algorithme";
Undo_Import = "Importer";
Undo_AddSignature = "Ajouter une signature";
Undo_RemoveSignature = "Supprimer la signature";
Undo_RevokeSignature = "Révoquer la signature";
Undo_AddSubkey = "Ajouter une sous-clé";
Undo_RemoveSubkey = "Supprimer la sous-clé";
Undo_RevokeSubkey = "Révoquer la sous-clé";
Undo_AddUserID = "Ajouter un ID utilisateur";
Undo_RemoveUserID = "Supprimer un ID utilisateur";
Undo_RevokeUserID = "Révoquer un ID utilisateur";
Undo_PrimaryUserID = "ID utilisateur primaire";
Undo_AddPhoto = "Ajouter une photo";
Undo_RefreshFromServer = "Rafraîchir depuis le serveur";
Undo_ReceiveFromServer = "Recevoir depuis le serveur";



/* Algorithm names */
CIPHER_ALGO_NONE = "Aucun";
CIPHER_ALGO_IDEA = "IDEA";
CIPHER_ALGO_3DES = "3DES";
CIPHER_ALGO_CAST5 = "CAST5";
CIPHER_ALGO_BLOWFISH = "BLOWFISH";
CIPHER_ALGO_AES = "AES";
CIPHER_ALGO_AES192 = "AES192";
CIPHER_ALGO_AES256 = "AES256";
CIPHER_ALGO_TWOFISH = "TWOFISH";
CIPHER_ALGO_CAMELLIA128 = "CAMELLIA128";
CIPHER_ALGO_CAMELLIA192 = "CAMELLIA192";
CIPHER_ALGO_CAMELLIA256 = "CAMELLIA256";
DIGEST_ALGO_MD5 = "MD5";
DIGEST_ALGO_SHA1 = "SHA1";
DIGEST_ALGO_RMD160 = "RMD160";
DIGEST_ALGO_SHA256 = "SHA256";
DIGEST_ALGO_SHA384 = "SHA384";
DIGEST_ALGO_SHA512 = "SHA512";
DIGEST_ALGO_SHA224 = "SHA224";
COMPRESS_ALGO_NONE = "Aucun";
COMPRESS_ALGO_ZIP = "ZIP";
COMPRESS_ALGO_ZLIB = "ZLIB";
COMPRESS_ALGO_BZIP2 = "BZIP2";

GPG_RSAAlgorithm = "RSA";
GPG_RSAEncryptOnlyAlgorithm = "RSA-E";
GPG_RSASignOnlyAlgorithm = "RSA-S";
GPG_ElgamalEncryptOnlyAlgorithm = "ELG-E";
GPG_DSAAlgorithm = "DSA";
GPG_ECDHAlgorithm = "ECDH";
GPG_ECDSAAlgorithm = "ECDSA";
GPG_ElgamalAlgorithm = "ELG";
GPG_DiffieHellmanAlgorithm = "Diffie-Hellman";
GPG_EdDSAAlgorithm = "EdDSA";
"Algorithm_%i" = "Algorithme_%i";

/* GPGSignature humanReadableDescription */
"Signed" = "Signé";
"Signature expired" = "Signature expirée";
"Key expired" = "Clé expirée";
"Bad signature" = "La signature et les données ne correspondent pas. Ceci peut signifier que les données ont été altérées.";
"Signature revoked" = "Signature révoquée";
"Signature error" = "Signature erronée";
"Unverifiable signature" = "La signature ne peut être vérifiée.";
"Signed by stranger" = "La signature ne peut être vérifiée, car la clé publique corresponde est manquante.";


/* Key Descriptions */
KeyDescriptionAndMore = "and %lu more";


/* Key Expiry Warning */
KeyExpiryWarning_Title = "Warning: Your key is about to expire";
KeyExpiryWarning_Msg = "Your key will expire on %1$@:\n\n%2$@\n\nExpired keys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this key.\n\nIf you choose to extend your key, it will be valid for two more years.\n\nDo you want to extend your key?";
KeyExpiryWarning_Yes = "Extend Key";
KeyExpiryWarning_No = "Cancel";
KeyExpiryWarning_Suppress = "Do Not Ask Again";

SubkeyExpiryWarning_Title = "Warning: Your subkey is about to expire";
SubkeyExpiryWarning_Msg = "Your subkey will expire on %1$@:\n\n%2$@\n\nExpired subkeys can not be used to encrypt or sign new messages. Decryption will continue to work. Your friends will not be able to send encrypted messages using this subkey.\n\nIf you choose to extend your subkey, it will be valid for two more years.\n\nDo you want to extend your subkey?";
SubkeyExpiryWarning_Yes = "Extend Subkey";
SubkeyExpiryWarning_No = "Cancel";
SubkeyExpiryWarning_Suppress = "Do Not Ask Again";

WrongPasswordTryAgain_Title = "You entered the wrong password";
WrongPasswordTryAgain_Msg = "Do you want to try it again?";
WrongPasswordTryAgain_Yes = "Try Again";
WrongPasswordTryAgain_No = "Cancel";

KeyExpiryFailed_Title = "Failed to extend your key!";
KeyExpiryFailed_Msg = "The key\n%1$@\ncould not be extened.\n\nError: %2$@";

KeyExtendedWantToUpload_Title = "Your key was extended successfully";
KeyExtendedWantToUpload_Msg = "In order for others to be able to see the new expiration date, it is necessary for them to import your updated key. Therefore it is recommended to upload your updated public key to the key servers.\n\nWarning: Key servers are public, so the name and email you use in your key will be publicly visible. Keys can not be deleted from the key servers. They can be revoked but not removed.\n\nIf you rather prefer not to use key servers, please consider attaching your public key to your signed and encrypted emails.\n\nDo you want to upload your public key?";
KeyExtendedWantToUpload_Yes = "Upload Public Key";
KeyExtendedWantToUpload_No = "No, Thanks!";

UploadFailed_Title = "Failed to upload the key!";
UploadFailed_Msg = "The key could not be uploaded to the keyserver.\n\nError: %@";


UpdaterNotWorking_Title = "The GPG Suite Updater doesn't work as expected!";
UpdaterNotWorking_Msg = "Please download and reinstall GPG Suite from https://gpgtools.org";


SwitchToOldKeyserver_Title = "Warning: You are about to switch the key server";
SwitchToOldKeyserver_Msg = "Switching to the old key servers will lower the quality of search results. While keys.openpgp.org allows verification of the email address and only then will show the email in search results, the old key servers do not support that mechanism.\n\nWe recommend to keep using keys.openpgp.org\n\nDo you really want to switch the key server?";
SwitchToOldKeyserver_No = "Cancel";
SwitchToOldKeyserver_Yes = "Switch to old Key Server";


